CSI API ETABS v1
cLinkObj.AddByPoint Method
 Adds a new link object whose end points are specified by name.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AddByPoint(
	string Point1,
	string Point2,
	ref string Name,
	bool IsSingleJoint = false,
	string PropName = "Default",
	string UserName = ""
)
Function AddByPoint (
	Point1 As String,
	Point2 As String,
	ByRef Name As String,
	Optional IsSingleJoint As Boolean = false,
	Optional PropName As String = "Default",
	Optional UserName As String = ""
) As Integer
Dim instance As cLinkObj
Dim Point1 As String
Dim Point2 As String
Dim Name As String
Dim IsSingleJoint As Boolean
Dim PropName As String
Dim UserName As String
Dim returnValue As Integer
returnValue = instance.AddByPoint(Point1,
	Point2, Name, IsSingleJoint, PropName,
	UserName)
int AddByPoint(
	String^ Point1,
	String^ Point2,
	String^% Name,
	bool IsSingleJoint = false,
	String^ PropName = L"Default",
	String^ UserName = L""
)
abstract AddByPoint :
        Point1 : string *
        Point2 : string *
        Name : string byref *
        ?IsSingleJoint : bool *
        ?PropName : string *
        ?UserName : string
(* Defaults:
        let _IsSingleJoint = defaultArg IsSingleJoint false
        let _PropName = defaultArg PropName "Default"
        let _UserName = defaultArg UserName ""
*)
-> int
Parameters
Point1
Type: System.String
The name of a defined point object at the I-End of the added link object.
Point2
Type: System.String
The name of a defined point object at the J-End of the added link object.
This item is ignored if the IsSingleJoint item is True.
Name
Type: System.String
This is the name that the program ultimately assigns for the link object. If no UserName is specified, the program assigns a default name to the link object. If a UserName is specified and that name is not used for another link object, the UserName is assigned to the link object; otherwise a default name is assigned to the link object.
IsSingleJoint (Optional)
Type: System.Boolean
This item is True if a one-joint link is added and False if a two-joint link is added.
PropName (Optional)
Type: System.String
This is either Default or the name of a defined link property.
If it is Default the program assigns a default link property to the link object. If it is the name of a defined link property, that property is assigned to the link object
UserName (Optional)
Type: System.String
Return Value
Type: Int32
Returns zero if the link object is successfully added; otherwise it returns a nonzero value.
Remarks
One-joint links are not supported in ETABS.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name1 As String
       Dim Name2 As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("2", "4", Name1)
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name2)
   'refresh view
       ret = SapModel.View.RefreshView
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace